In [1]:
#%pip install pymysql

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
import numpy as np

### CONEXIÓN A SQL Y CREACIÓN DE BBDD

In [3]:
import mysql.connector as conn
from sqlalchemy import create_engine

In [4]:
df_act=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/actor_clean.csv')
df_cat=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/category_clean.csv')
df_film=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/film_clean.csv')
df_inv=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/inventory_clean.csv')
df_lang=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/language_clean.csv')
df_old=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/old_HDD_clean.csv')
df_ren=pd.read_csv(r'C:\Users\david\OneDrive\Documentos\DATA ANALYTICS\Proyectos\Github\Ironhack_proyectos\w3-database-project\data_clean/rental_clean.csv')

In [5]:
with open('contraseñas.txt', 'r') as file:
    pass_=file.readlines()[0]

In [6]:
str_conn=f'mysql+pymysql://root:{pass_}@localhost:3306' #Conectar al servidor
cursor=create_engine(str_conn) #Cursor que apunta al servidor

In [7]:
#cursor.execute('drop database if exists proy_videoclub;')

In [8]:
#cursor.execute('create database proy_videoclub;')

In [9]:
str_conn=f'mysql+pymysql://root:{pass_}@localhost:3306/proy_videoclub'
cursor=create_engine(str_conn)

### CARGA DE DATOS

In [10]:
#df_act.to_sql(name='actor', con=cursor, if_exists='replace', index=False)
#df_cat.to_sql(name='category', con=cursor, if_exists='replace', index=False)
#df_film.to_sql(name='film', con=cursor, if_exists='replace', index=False)
#df_inv.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)
#df_old.to_sql(name='old_HDD', con=cursor, if_exists='replace', index=False)
#df_ren.to_sql(name='rental', con=cursor, if_exists='replace', index=False)
#df_lang.to_sql(name='language', con=cursor, if_exists='replace', index=False)

### SELECCIÓN DE PRIMARY KEYS Y FOREIGN KEYS. CREACIÓN DE RELACIONES ENTRE TABLAS
Realizado en Workbench. EER Diagram disponible en repositorio.

### SQL QUERIES

In [11]:
#1 CUÁNTAS PELÍCULAS DE LA TABLA PELÍCULAS ESTÁN SIENDO ALQUILADAS?
pd.read_sql('''

SELECT COUNT(R.RENTAL_ID) AS TOTAL_TITLES_FOR_RENT FROM RENTAL AS R
INNER JOIN INVENTORY AS I
ON R.INVENTORY_ID = I.INVENTORY_ID
INNER JOIN FILM AS F
ON I.FILM_ID = F.FILM_ID


''', cursor)

   TOTAL_TITLES_FOR_RENT
0                    212

In [12]:
#2 CUALES SON LAS 5 PELÍCULAS MÁS ALQUILADAS?
pd.read_sql('''

SELECT F.TITLE, COUNT(R.RENTAL_ID) AS TOTAL_RENTING_TIMES
FROM FILM AS F
RIGHT JOIN INVENTORY AS I 
ON F.FILM_ID = I.FILM_ID
RIGHT JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
GROUP BY F.TITLE
ORDER BY TOTAL_RENTING_TIMES DESC
LIMIT 6

''', cursor)

                  TITLE  TOTAL_RENTING_TIMES
0                  None                  788
1         BOOGIE AMELIE                    4
2       CENTER DINOSAUR                    3
3           ANTHEM LUKE                    3
4  BARBARELLA STREETCAR                    3
5    BUTTERFLY CHOCOLAT                    3

In [13]:
#3--- CUALES SON LOS 10 ACTORES/ACTRICES QUE MÁS SALEN EN LAS PELÍCULAS?
pd.read_sql('''

SELECT A.COMPLETE_NAME, COUNT(A.ACTOR_ID) AS TOTAL_TIMES FROM ACTOR AS A
INNER JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
GROUP BY COMPLETE_NAME
ORDER BY TOTAL_TIMES DESC
LIMIT 10

''', cursor)

   COMPLETE_NAME  TOTAL_TIMES
0  SANDRA KILMER           37
1       UMA WOOD           35
2     VAL BOLGER           35
3  JULIA MCQUEEN           33
4   RIP CRAWFORD           33
5   HELEN VOIGHT           32
6     KARL BERRY           31
7  WOODY HOFFMAN           31
8  LUCILLE TRACY           30
9   GRACE MOSTEL           30

In [14]:
#4 CUAL ES EL ACTOR QUE MÁS SE REPITE EN LAS PELÍCULAS DE DEPORTES?
pd.read_sql('''

SELECT COUNT(A.ACTOR_ID) AS TOTAL_TIMES, A.COMPLETE_NAME
FROM ACTOR AS A
RIGHT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
RIGHT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
LEFT JOIN CATEGORY AS C
ON O.CATEGORY_ID = C.CATEGORY_ID
WHERE NAME='SPORTS'
GROUP BY A.COMPLETE_NAME
ORDER BY TOTAL_TIMES DESC
LIMIT 1

''', cursor)

   TOTAL_TIMES    COMPLETE_NAME
0            5  BETTE NICHOLSON

In [15]:
#5--- LISTA DE 5 CATEGOÍAS ORDENADAS POR SU RENTAL_RATE MEDIO
pd.read_sql('''

SELECT C.NAME, AVG(F.RENTAL_RATE) AS AVG_RENTAL_RATE FROM CATEGORY AS C
LEFT JOIN OLD_HDD AS O
ON C.CATEGORY_ID = O.CATEGORY_ID
LEFT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
GROUP BY NAME
ORDER BY AVG_RENTAL_RATE DESC
LIMIT 5


''', cursor)

      NAME  AVG_RENTAL_RATE
0   Sci-Fi         3.610690
1   Travel         3.490000
2  Foreign         3.365000
3   Sports         3.243165
4    Games         3.200526

In [16]:
#6--- ACTORES QUE MENOS REPLACEMENT COST TIENE EN LAS PELÍCULAS
pd.read_sql('''

SELECT A.ACTOR_ID, A.COMPLETE_NAME, AVG(F.REPLACEMENT_COST) AS AVG_REPLACEMENT_COST FROM ACTOR AS A
LEFT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
INNER JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
GROUP BY ACTOR_ID
ORDER BY AVG_REPLACEMENT_COST
LIMIT 10


''', cursor)

   ACTOR_ID     COMPLETE_NAME  AVG_REPLACEMENT_COST
0        31    SISSY SOBIESKI             17.656667
1        21   KIRSTEN PALTROW             17.990000
2         3          ED CHASE             18.353636
3        13          UMA WOOD             18.532857
4        23     SANDRA KILMER             18.557568
5         4    JENNIFER DAVIS             18.717273
6        34    AUDREY OLIVIER             18.750000
7         1  PENELOPE GUINESS             18.779474
8        25       KEVIN BLOOM             18.799524
9        37        VAL BOLGER             19.104286

In [17]:
#7--- ACTORES QUE MÁS SALEN EN PELÍCULAS LARGAS SUPERIORES A 2 H

pd.read_sql('''

SELECT A.ACTOR_ID, A.COMPLETE_NAME, COUNT(F.LENGTH) AS TOTAL_TIMES FROM ACTOR AS A
LEFT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
LEFT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
WHERE F.LENGTH>120
GROUP BY ACTOR_ID
ORDER BY TOTAL_TIMES DESC
LIMIT 10



''', cursor)

   ACTOR_ID        COMPLETE_NAME  TOTAL_TIMES
0        23        SANDRA KILMER           20
1        13             UMA WOOD           19
2        16         FRED COSTNER           18
3        26         RIP CRAWFORD           17
4        17         HELEN VOIGHT           17
5        28        WOODY HOFFMAN           16
6        37           VAL BOLGER           15
7         8    MATTHEW JOHANSSON           14
8        38         TOM MCKELLEN           14
9         5  JOHNNY LOLLOBRIGIDA           14

In [18]:
#8 PELÍCULA MÁS LARGA CON MENOS RENTAS (DEBE TENER RENTAS) --- EL PELMAZO
pd.read_sql('''

SELECT S.TITLE, S.RENT_TIMES, LENGTH
FROM
(SELECT F.TITLE, COUNT(F.FILM_ID) AS RENT_TIMES, MAX(F.LENGTH) AS LENGTH
FROM FILM AS F
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
GROUP BY F.TITLE) AS S
WHERE RENT_TIMES = 1
ORDER BY LENGTH DESC
LIMIT 3

''', cursor)

            TITLE  RENT_TIMES  LENGTH
0  DARN FORRESTER           1     185
1  CONTROL ANTHEM           1     185
2   CHICAGO NORTH           1     185

In [19]:
#9 PELÍCULA DE ACCIÓN CON MÁS ACTORES 
pd.read_sql('''

SELECT F.TITLE, C.NAME, COUNT(A.COMPLETE_NAME) AS TOTAL_ACTORS
FROM FILM AS F
INNER JOIN OLD_HDD AS O
ON F.FILM_ID = O.FILM_ID
INNER JOIN ACTOR AS A
ON O.ACTOR_ID = A.ACTOR_ID
INNER JOIN CATEGORY AS C
ON O.CATEGORY_ID = C.CATEGORY_ID
WHERE C.NAME = 'ACTION'
GROUP BY F.TITLE
ORDER BY TOTAL_ACTORS DESC
LIMIT 1


''', cursor)

                 TITLE    NAME  TOTAL_ACTORS
0  RINGS HEARTBREAKERS  Action             4

In [20]:
#10 - ACTOR QUE EMPIEZA POR A CON MÁS PELÍCULAS
#pd.read_sql('''
#
#SELECT A.ACTOR_ID, A.COMPLETE_NAME, F.TITLE FROM ACTOR AS A
#LEFT JOIN OLD_HDD AS O
#ON A.ACTOR_ID = O.ACTOR_ID
#LEFT JOIN FILM AS F
#ON O.FILM_ID = F.FILM_ID
#WHERE A.COMPLETE_NAME LIKE "A%"
#
#
#''', cursor)

In [21]:
#11 - PELÍCULA DE GÉNERO DE SCI-FI QUE MÁS SE ALQUILA

pd.read_sql('''

SELECT COUNT(C.NAME) AS CATEGORY_NAME, F.TITLE FROM CATEGORY AS C
INNER JOIN OLD_HDD AS O
ON C.CATEGORY_ID = O.CATEGORY_ID
INNER JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
WHERE C.NAME = 'Action'
GROUP BY TITLE
ORDER BY CATEGORY_NAME DESC
LIMIT 1

''', cursor)

   CATEGORY_NAME            TITLE
0              4  AMERICAN CIRCUS

In [22]:
#12--- TOP 3 ACTORES QUE MÁS SE ALQUILAN EN EL VIDEO CLUB
pd.read_sql('''

SELECT COUNT(A.ACTOR_ID) AS RENT_TIMES, A.COMPLETE_NAME FROM ACTOR AS A
INNER JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
INNER JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
GROUP BY A.COMPLETE_NAME
ORDER BY RENT_TIMES DESC
LIMIT 3

''', cursor)

   RENT_TIMES     COMPLETE_NAME
0          13      RIP CRAWFORD
1          11     SANDRA KILMER
2          10  PENELOPE GUINESS